[
  {
    "word": "Bumfuzzler",
    "meaning": "This is a simple term that refers to being confused, perplexed, or flustered or to cause confusion. You have probably heard your grandma or grandpa use this phrase, especially if they are from the East Coast or below the Mason-Dixon Line. This word is derived from the Old English dumfoozle."
  },
  {
    "word": "Cattywampus",
    "meaning": "This is a term that you will find in the Midland and Southern United States. It is referring to something that is in disarray, that is askew, or something that is not directly across from something. For example, a post office might be cattywampus from the library. You might actually know this word by the terms catty-corner, kitty-corner, or catawampus."
  },
  {
    "word": "Gardyloo",
    "meaning": "This is actually a Scottish term, but it sounds really nifty! The definition is a funny and gross one; this is what people living in Edinburgh shouted out their windows as a warning before dumping their slop buckets out of their windows. At least they gave a little bit of a warning to those below!"
  },
  {
    "word": "Taradiddle",
    "meaning": "This word references someone or something that is filled with pretentious nonsense or something that is a lie. A great example of this is that classic fisherman tale of how big the fish he caught was. Usually the fisherman is lying or at least exaggerating about the fish, especially if he (or she) did not keep the fish."
  },
  {
    "word": "Snickersnee",
    "meaning": "While this word sounds like something funny or possibly cute, it is actually referring to a long, dangerous knife. It was first used in reference to cut-and-thrust fighting in the 1700s and is still occasionally used when referencing the knife, though it is becoming more and more obsolete."
  },
  {
    "word": "Widdershins",
    "meaning": "This is another way to say something is moving counter-clockwise or something is moving in the wrong direction. It is a much more fun way to say counter-clockwise and is most likely something you heard one of your grandparents or great-grandparents say. Many people do still use it in many poems and newly published books."
  },
  {
    "word": "Collywobbles",
    "meaning": "This refers to a weird feeling in your stomach or an overall bellyache. It is derived from the Latin phrase cholera morbus, meaning it came from the disease we all know as cholera. This is a word many people still use especially older individuals, and the background is quite dark! Many do not realize the dark background much like many being unaware of the origins of Ring around the Rosie."
  },
  {
    "word": "Gubbins",
    "meaning": "This is an object that has little or no value and is also referring to a gadget or device. It can also refer to odds and ends or rubbish and, oddly enough, can be used to describe a silly person. We do not know about you, but it seems a little strange that a word describing something with little to no value also refers to someone who is silly."
  },
  {
    "word": "Abibliophobia",
    "meaning": "Now this is a word that perfectly describes many people and you may be one! This refers to someone who is afraid of running out of things to read. We are guessing that you are probably going to start using this word to describe yourself as you head out the door to the nearest Barnes and Noble or local bookshop."
  },
  {
    "word": "Bumbershoot",
    "meaning": "Here is a fun word that most people know. This is referring to an umbrella and is something we have heard in many a Disney film or in many different books. It is quite fun to grab your umbrella and say in a fun voice, I think I need my bumbershoot today!"
  }
]
